runs/w4_laminarPipeFlowFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.15 0 0);

boundaryField
{
    inlet
    {
        type            swirlInletVelocity;
        origin          (0 0 0);
        axis            (1 0 0);
        radialVelocity      constant 0;
        tangentialVelocity  constant 0;
        axialVelocity   table
        (
            (-0.05 0)
            (-0.04 0.108)
            (-0.03 0.192)
            (-0.02 0.252)
            (-0.01 0.288)
            (0 0.3)
            (0.01 0.288)
            (0.02 0.252)
            (0.03 0.192)
            (0.04 0.108)
            (0.05 0)

        );
        value           uniform (0.15 0 0);
    }
    
    outlet
    {
        type            inletOutlet; //zeroGradient;
        inletValue      uniform (0 0 0);
    }
    
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
